wst/trunk/tests/test_suite/files/soap_inline_ns.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
      <ns4:c  xmlns:ns4="NameSpace.C">
        <ns4:Prop_String>This property should be in : NameSpace.C</ns4:Prop_String>
        <ns2:Prop_A  xmlns:ns2="NameSpace.A">
          <ns2:Qualified_Val_Bool>false</ns2:Qualified_Val_Bool>
          <ns2:Qualified_Val_Enum>steOne</ns2:Qualified_Val_Enum>
          <ns2:Qualified_Val_Integer>0</ns2:Qualified_Val_Integer>
          <ns2:Qualified_Val_Int64>0</ns2:Qualified_Val_Int64>
          <ns2:Qualified_Val_String>This property should be in : NameSpace.A</ns2:Qualified_Val_String>
        </ns2:Prop_A>
        <ns3:Prop_B  xmlns:ns2="NameSpace.A" xmlns:ns3="NameSpace.B">
          <ns2:Qualified_Val_Bool>false</ns2:Qualified_Val_Bool>
          <ns2:Qualified_Val_Enum>steFour</ns2:Qualified_Val_Enum>
          <ns2:Qualified_Val_Integer>789</ns2:Qualified_Val_Integer>
          <ns2:Qualified_Val_Int64>64</ns2:Qualified_Val_Int64>
          <ns2:Qualified_Val_String>This inherited property should be in : NameSpace.A</ns2:Qualified_Val_String>
          <ns3:Val_Bool>true</ns3:Val_Bool>
          <ns3:Val_String>local elemet. This property should be in : NameSpace.B</ns3:Val_String>
        </ns3:Prop_B>
      </ns4:c>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
